iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/ЖурналОтъема/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись ИЗ ЭтотОбъект Цикл   
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0  Тогда
			ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
			ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
			ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
			ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
			ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем;
			ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
			ЗаписьСтатус.Записать(Истина);
		Иначе                             
			Для Каждого ЗаписьСтатус ИЗ НаборЗаписей Цикл
				Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса)  И (Запись.Период > ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
					ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
					ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
					ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
					ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем; 
					ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
				КонецЕсли;	
			КонецЦикла; 
			НаборЗаписей.Записать(Истина);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись ИЗ ЭтотОбъект Цикл 
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать(); 
		Если НаборЗаписей.Количество() = 1 Тогда 
			Если НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка  И Запись.НомерОпороса = 0 Тогда 
				Сообщить("Для свиноматки " + Запись.НомерЖивотного + " не внесен опорос."); 	
				Если НЕ Константы.ОтключитьКонтрольОшибок.Получить() Тогда
					Отказ = Истина;	                                                                                          
					ВызватьИсключение("Для свиноматки " + Запись.НомерЖивотного + " не внесен опорос.");  
				КонецЕсли;
			ИначеЕсли НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос  И Запись.НомерОпороса = 0  И НаборЗаписей[0].ДатаПоследнегоСобытия >= Запись.Период Тогда 
				Сообщить("Для свиноматки " + Запись.НомерЖивотного + " Дата отъема должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy"));
				Если НЕ Константы.ОтключитьКонтрольОшибок.Получить() Тогда
					Отказ = Истина;	  
					ВызватьИсключение("Для свиноматки " + Запись.НомерЖивотного + " Дата отъема должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy")); 		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
